Revit 2018 API
OverrideGraphicSettings.SetProjectionFillPatternVisible Method
 Sets the visibility of the projection surface fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
public OverrideGraphicSettings SetProjectionFillPatternVisible(
	bool projectFillPatternVisible
)
Visual Basic
Public Function SetProjectionFillPatternVisible ( _
	projectFillPatternVisible As Boolean _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetProjectionFillPatternVisible(
	bool projectFillPatternVisible
)
Parameters
projectFillPatternVisible
Type: System.Boolean
 Value of the visibility of the projection surface fill pattern.
Return Value
 Reference to the changed object.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace